9/data/attachments/bb8a8b0833114845.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Samantha_price_Friend_50866_9</nif:username>
            <nif:friendToBeRequested>soap_friends_57c0ffc4-d148-40b0-9854-4359852bcd50</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>